---
kind: method
id: M:Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.GetFailuresAccessor
source: html/a47a6c09-80c9-8748-47e0-4142f149b8c6.htm
---
# Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.GetFailuresAccessor Method

Provides access to the failure information in the document.

## Syntax (C#)
```csharp
public FailuresAccessor GetFailuresAccessor()
```

## Returns
The accessor to the failures in the document.